test-param-2.yml
config:
  target: "https://xyz.in/"
  http:
  # Responses have to be sent within 10 seconds, or an `ETIMEDOUT` error gets raised.
  timeout: 10
  phases:
    - duration: 60
      arrivalRate: 100
      name: Warm up
    - duration: 120
      arrivalRate: 500
      rampTo: 1000
      name: Ramp up load
    - duration: 600
      arrivalRate: 5000
      name: Sustained load
    - duration: 1000
      arrivalRate: 10000
      name: Over load

scenarios:
  - name: Get UI
    flow:
      - post:
          url: "/savecareer"
          formData:
            Name: "null"
            EmailID: "null"
            MobileNo: "null"
            Comments: "null"
            Image: "null"
          expect:
            - statusCode: 200
      - post:
          url: "/saveEnquiry"
          formData:
            Name: "null"
            EmailID: "null"
            MobileNo: "null"
            Comments: "null"
            ContactType: 1
          expect:
            - statusCode: 200
      - post:
          url: "/saveEnquiry"
          formData:
            Name: "null"
            EmailID: "null"
            MobileNo: "null"
            Comments: "null"
            ContactType: 0
          expect:
            - statusCode: 200
      - post:
          url: "/saveEnquiry"
          formData:
            Name: "null"
            EmailID: "null"
            MobileNo: "null"
            Comments: "null"
            ContactType: 2
          expect:
            - statusCode: 200